import React from 'react';
import { Col, Container, Row } from 'react-bootstrap';
import './Blogs.css'

const Blogs = () => {
    return (
        <Container className='py-5'>
            <Row>
                <Col lg={6} md={6} sm={12}>
                <div className="card">
                    <div className="card-body">
                        <div className="question">
                        <h1>What is Context API?</h1>
                        <p className='question-ans'>
                        প্রতিক্রিয়া সম্পর্কে একটি দুর্দান্ত জিনিস হ'ল আমাদের কাছে নির্দিষ্ট সমস্যাগুলি সমাধান করার জন্য বিভিন্ন উপায় রয়েছে। আমাদের কাছে কয়েকটি ভিন্ন ফর্মের লাইব্রেরি রয়েছে, অনেকগুলি CSS লাইব্রেরি এবং React-এর সবচেয়ে গুরুত্বপূর্ণ অংশে, আমাদের কাছে অনেকগুলি আলাদা লাইব্রেরি রয়েছে যা React-এ ডেটা সমস্যা রিপোর্ট করার জন্য নিবেদিত। আমাদের প্রকল্পে লাইব্রেরি কখন ব্যবহার করতে হবে তা নির্ধারণ করা একটি দক্ষতা যা আমরা তথ্য ব্যবহারের মাধ্যমে বিকাশ করি। বিশেষ করে প্রতিক্রিয়াতে, যখন আমাদের কাছে বেছে নেওয়ার মতো অনেকগুলি লাইব্রেরি থাকে, তখন আমরা কখনও কখনও আমাদের প্রয়োজন নেই এমন লাইব্রেরিগুলি ইনস্টল এবং ব্যবহার করে শেষ করতে পারি। কনটেক্সট এপিআই হল একটি রিঅ্যাক্ট এপিআই যা আধুনিক অ্যাপ্লিকেশনগুলি বিশ্বের পরিচালনার ক্ষেত্রে এবং কীভাবে এটি এর উপাদানগুলির স্থিতি প্রকাশ করে তার অনেক সমস্যার সমাধান করতে পারে।
                        </p>
                        </div>
                    </div>
                </div>
                </Col>
                <Col lg={6} md={6} sm={12}>
                <div className="card">
                    <div className="card-body">
                        <div className="question">
                        <h1>What is Semantic Tag?</h1>
                        <p className='question-ans'>
                        প্রতিক্রিয়া সম্পর্কে একটি দুর্দান্ত জিনিস হ'ল আমাদের কাছে নির্দিষ্ট সমস্যাগুলি সমাধান করার জন্য বিভিন্ন উপায় রয়েছে। আমাদের কাছে কয়েকটি ভিন্ন ফর্মের লাইব্রেরি রয়েছে, অনেকগুলি CSS লাইব্রেরি এবং React-এর সবচেয়ে গুরুত্বপূর্ণ অংশে, আমাদের কাছে অনেকগুলি আলাদা লাইব্রেরি রয়েছে যা React-এ ডেটা সমস্যা রিপোর্ট করার জন্য নিবেদিত। আমাদের প্রকল্পে লাইব্রেরি কখন ব্যবহার করতে হবে তা নির্ধারণ করা একটি দক্ষতা যা আমরা তথ্য ব্যবহারের মাধ্যমে বিকাশ করি। বিশেষ করে প্রতিক্রিয়াতে, যখন আমাদের কাছে বেছে নেওয়ার মতো অনেকগুলি লাইব্রেরি থাকে, তখন আমরা কখনও কখনও আমাদের প্রয়োজন নেই এমন লাইব্রেরিগুলি ইনস্টল এবং ব্যবহার করে শেষ করতে পারি। কনটেক্সট এপিআই হল একটি রিঅ্যাক্ট এপিআই যা আধুনিক অ্যাপ্লিকেশনগুলি বিশ্বের পরিচালনার ক্ষেত্রে এবং কীভাবে এটি এর উপাদানগুলির স্থিতি প্রকাশ করে তার অনেক সমস্যার সমাধান করতে পারে।
                        </p>
                        </div>
                    </div>
                </div>
                </Col>
            </Row>
        </Container>
    );
};

export default Blogs;